### . Write class which has at two methods:
###                - get_input: to get a string from console input
###                - print_output: to print the string in lower case.

In [3]:
class DemoString:
    def __init__(self):
        self.inputString = None
    
    def get_input(self, input_string):
        self.input_string = input_string
        
    def print_input(self):
        return self.input_string.lower()

In [4]:
my_object = DemoString()
my_string = input('Enter a string:')
my_object.get_input(my_string)
my_object.print_input()

Enter a string: JOHN

'john'

### Merge 2 csv's

In [12]:
import pandas as pd
import os

csv1 = pd.read_csv('Book1.csv')
csv2 = pd.read_csv('Book2.csv')

merge_csv = pd.concat([csv1,csv2])
merge_csv.shape

merge_csv.to_csv('merged_csv.csv')

In [6]:
csv1.columns

Index(['local_day_of_week', 'days_to_expire', 'prev_merchant_number',
       'status_string', 'issuer_country_curr_match', 'division_site_id', 'bin',
       'exp_setting_id', 'incr_bank'],
      dtype='object')

In [8]:
merge_csv.head()

,local_day_of_week,days_to_expire,prev_merchant_number,status_string,issuer_country_curr_match,division_site_id,bin,exp_setting_id,incr_bank
0,7,1939,1156962062-INR-pacific,NaN,True,avgstore,428093,NaN,- Kotak Mahindra Bank Ltd
1,7,1939,1156962062-INR-pacific,"Declined,Declined",True,avgstore,428093,NaN,- Kotak Mahindra Bank Ltd
2,7,1360,1156962062-INR-pacific,NaN,True,avgstore,559405,NaN,- ICICI BANK LIMITED
3,7,1360,1156962062-INR-pacific,"Declined,Declined",True,avgstore,559405,NaN,- ICICI BANK LIMITED
4,7,1725,1156962062-INR-pacific,NaN,True,avgstore,541919,NaN,- HDFC BANK LIMITED

In [ ]:
# query = '''CREATE TABLE IF NOT EXISTS data (local_day_of_week int, days_to_expire int, prev_merchant_number int)'''

In [196]:
import mysql.connector
# import pymysql

In [197]:
conn = mysql.connector.connect(host = 'localhost', user = 'root', passwd = 'root', allow_local_infile=True)
# conn = pymysql.connect(host = 'localhost', user = 'root', passwd = 'root')

In [198]:
cursor = conn.cursor(buffered= True)
# cursor = conn.cursor()

In [4]:
cursor.execute('SHOW DATABASES;')

In [5]:
for i in cursor:
    print(i)

('demo',)
('information_schema',)
('mysql',)
('new_schema',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [200]:
cursor.execute("USE demo")

In [201]:
cursor.execute('SHOW TABLES')

In [202]:
for i in cursor:
    print(i)

('mergedata',)
('people',)
('student',)
('tbl_campaign',)
('tbl_campaign_try1',)
('tbl_clicks',)
('tbl_impressions',)

## Write code to load data from CSV file into DB

In [9]:
q_create_table =  '''CREATE TABLE IF NOT EXISTS MergeData (local_day_of_week INT, days_to_expire INT, prev_merchant_number INT,
       status_string VARCHAR(30), issuer_country_curr_match BOOL, division_site_id VARCHAR(15), bin INT,
       exp_setting_id INT, incr_bank VARCHAR(50))'''
cursor.execute(q_create_table)

In [10]:
conn.commit()

In [177]:
cursor.execute('''SHOW VARIABLES LIKE 'local_infile';''')

In [178]:
# cursor.execute('DROP TABLE MergeData;')

In [94]:
query_csv = '''LOAD DATA LOCAL INFILE  'merged_csv.csv'
                INTO TABLE MergeData
                FIELDS TERMINATED BY ',' 
                ENCLOSED BY '"'
                LINES TERMINATED BY '\n'
                IGNORE 1 ROWS;'''
cursor.execute(query_csv)

In [129]:
conn.commit()

In [179]:
cursor.execute('SELECT * FROM MergeData;')

In [180]:
cursor.fetchall()

[(0, 7, 1939, '1156962062-INR-pacific', 0, 'True', 0, 428093, ''),
 (1, 7, 1939, '1156962062-INR-pacific', 0, 'True', 0, 428093, ''),
 (2, 7, 1360, '1156962062-INR-pacific', 0, 'True', 0, 559405, ''),
 (3, 7, 1360, '1156962062-INR-pacific', 0, 'True', 0, 559405, ''),
 (4, 7, 1725, '1156962062-INR-pacific', 0, 'True', 0, 541919, ''),
 (0, 7, 1939, '1156962062-INR-pacific', 0, 'True', 0, 428093, ''),
 (1, 7, 1939, '1156962062-INR-pacific', 0, 'True', 0, 428093, ''),
 (2, 7, 1360, '1156962062-INR-pacific', 0, 'True', 0, 559405, ''),
 (3, 7, 1360, '1156962062-INR-pacific', 0, 'True', 0, 559405, ''),
 (4, 7, 1725, '1156962062-INR-pacific', 0, 'True', 0, 541919, '')]

### Suppose CSV file provides campaign_id, campaign_name, impressions, clicks, date etc. Then write code to -
###                 - Read data from CSV files
###                 - Store in DB table as raw data
###                - Apply transformation and store into new DB table
###                                - Add "Campaign:" as prefix to campaign_name
###                                 - Calculate CTR and store into new field

In [13]:
campaign_csv = pd.read_csv('campaignData.csv')

In [14]:
campaign_csv.columns

Index(['campaign_id', 'campaign_name', 'impressions', 'clicks', 'date'], dtype='object')

In [15]:
campaign_csv.head()

   campaign_id campaign_name  impressions  clicks       date
0         1001       Dominos          100      58   1/2/2019
1         1001       Dominos          150      35   2/2/2019
2         1001       Dominos           90      52  12/2/2019
3         1002    McDonald's           70      34  12/3/2019
4         1002    McDonald's           95      70  19/3/2019

In [153]:
# The date in csv is in dd/mm/yyyy format but mysql requires date in yyyy-mm-dd format. So transforming in the required format
# campaign_csv['date'] = pd.to_datetime(campaign_csv.date)

In [190]:
campaign_csv.reset_index(inplace= True)

In [193]:
campaign_csv.rename(columns = {'index':'unique_id'}, inplace= True)

In [204]:
campaign_csv.to_csv('campaign_staging.csv', index= False)

In [163]:
campaign_staging = pd.read_csv('campaign_staging.csv')

In [164]:
campaign_staging.head()

   unique_id  campaign_id campaign_name  impressions  clicks       date
0          0         1001       Dominos          100      58   1/2/2019
1          1         1001       Dominos          150      35   2/2/2019
2          2         1001       Dominos           90      52  12/2/2019
3          3         1002    McDonald's           70      34  12/3/2019
4          4         1002    McDonald's           95      70  19/3/2019

In [152]:
campaign_staging['campaign_name'] = 'Campaign ' + campaign_staging['campaign_name']

In [153]:
campaign_staging['CTR'] = campaign_staging.clicks/campaign_staging.impressions

In [170]:
# campaign_staging['date'] = pd.to_datetime(campaign_staging.date)
campaign_staging.date[0]

'2019-01-02'

In [168]:
campaign_staging.date = campaign_staging.date.map(lambda x: x.strftime('%Y-%m-%d'))

In [169]:
campaign_staging.head()

   unique_id  campaign_id campaign_name  impressions  clicks        date
0          0         1001       Dominos          100      58  2019-01-02
1          1         1001       Dominos          150      35  2019-02-02
2          2         1001       Dominos           90      52  2019-12-02
3          3         1002    McDonald's           70      34  2019-12-03
4          4         1002    McDonald's           95      70  2019-03-19

In [207]:
from sqlalchemy import create_engine
# engine = create_engine('mysql+mysqlconnector://'+os.environ['MYSQL_USER']+':'+os.environ['MYSQL_PASSWORD']+'@'+os.environ['MYSQL_HOST_IP']+':'+os.environ['MYSQL_PORT']+'/sandbox', echo=False)


# engine = create_engine('mysql+mysqlconnector://[root]:[root]@[localhost]:[3306]/[demo]', echo=False)
engine = create_engine('mysql+mysqlconnector://root:root@localhost/demo')

In [172]:
try:
    campaign_staging.to_sql(name='tbl_campaign_try1', con=engine, if_exists = 'fail', index=False)
except ValueError:
    print('The table already exists')

In [130]:
pd.to_datetime()

,unique_id,campaign_id,campaign_name,impressions,clicks,date,CTR
0,0,1001,Campaign Dominos,100,58,1/2/2019,0.580000
1,1,1001,Campaign Dominos,150,35,2/2/2019,0.233333
2,2,1001,Campaign Dominos,90,52,12/2/2019,0.577778
3,3,1002,Campaign McDonald's,70,34,12/3/2019,0.485714
4,4,1002,Campaign McDonald's,95,70,19/3/2019,0.736842

In [22]:
# cursor.execute('DROP TABLE tbl_campaign')

### Loading data into DB using MYSQL Query

In [119]:
cursor.execute('''CREATE TABLE IF NOT EXISTS tbl_campaign (unique_id INT PRIMARY KEY, campaign_id INT, campaign_name VARCHAR(30), impressions INT, clicks INT, campaign_date DATE);''')

In [188]:
cursor.execute('TRUNCATE tbl_campaign;')
conn.commit()

In [24]:
query2 = '''LOAD DATA LOCAL INFILE 'campaign_staging.csv'
            REPLACE
            INTO TABLE tbl_campaign
            FIELDS TERMINATED BY ','
            ENCLOSED BY '"'
            LINES TERMINATED BY '\n'
            IGNORE 1 ROWS
            (unique_id, campaign_id, campaign_name, impressions, clicks, @temporary_date_variable)
            SET campaign_date = STR_TO_DATE(@temporary_date_variable, '%d/%m/%Y');'''
cursor.execute(query2)
conn.commit()

#### Reading table directly into dataframe using pd.read_sql()

In [126]:

df = pd.read_sql('SELECT * FROM student', engine)


# engine = create_engine('mysql://root:root@localhost/demo')
# engine = create_engine('mysql+mysqlconnector://root:root@localhost/demo')
# connection = engine.raw_connection()
# with engine.connect() as conn, conn.begin():
# campaign_staging.to_sql('Table1', engine, if_exists='replace')
# connection.

### Loading data in DB using Pandas
#### 1. Read CSV and store it as dataframe
#### 2. Use dataframe.to_sql() and store dataframe into DB

In [30]:
# campaign_staging.to_sql(con=conn, name='campaign_transformed', if_exists='replace')
# campaign_staging.to_sql('campaign_transformed',engine, schema=None, if_exists='fail', index=True, index_label=None, chunksize=None, dtype=None)
try:
    campaign_staging.to_sql(name='tbl_campaign_staging', con=engine, if_exists = 'fail', index=False)
except ValueError:
    print('The table already exists')

The table already exists

### Write code to -
###                 - Read CSV file in below format –
                 

###                 - Create new file like below –

In [31]:
campData = pd.read_csv('newData.csv')

In [32]:
campData.head()

,keys,clicks,impressions,ctr,position
0,"['panasonic','https://www.panasonic.com/tha/',...",89,211,0.421801,1.023697
1,"['McDonalds','https://www.McDonalds.com/tha/',...",99,212,0.466981,2.023697
2,"['dominos','https://www.dominos.com/tha/','DES...",91,213,0.427230,3.023697
3,"['panasonic','https://www.panasonic.com/tha/',...",92,214,0.429907,4.023697
4,"['McDonalds','https://www.McDonalds.com/tha/',...",100,222,0.450450,5.023697

In [ ]:
campData.apply(lambda row: row.keys)

In [85]:
campaign_data = campData.copy()

In [87]:
campaign_data.drop('keys', axis= 1, inplace= True)

In [88]:
campaign_data.head()

   clicks  impressions       ctr  position
0      89          211  0.421801  1.023697
1      99          212  0.466981  2.023697
2      91          213  0.427230  3.023697
3      92          214  0.429907  4.023697
4     100          222  0.450450  5.023697

In [104]:
for index in range(len(campData['keys'][0].split(','))):
    campaign_data[index] = campData['keys'].apply(lambda row: row[1:-1].split(',')[index])
    print(index)
#     print(row[0][1:-1].split(',')[1])
#     print(row[0][1:-1].split(',')[2])
#     print(row[0][1:-1].split(',')[3])

0
1
2
3

In [111]:
campaign_data = campaign_data.reindex(columns=[0,1,2,3,'clicks','impressions','ctr','position'])
desired_col=['keys','website','device','country','clicks','impressions','ctr','position']
campaign_data.columns=desired_col

In [173]:
campaign_data.to_csv('camp_data_separated.csv')

### Create 2 DB tables 
###                 - tbl_clicks - campaign_id, clicks, date
###                 - tbl_impressions - campaign_id, impressions, date
###                 - Add some dummy data
###                 - Write code to -
###                                 - Show Impressions, clicks, CTR against each campaign per date for last 4 days
###                                 - Show Impressions, clicks, CTR against each campaign
###                                 - Show Total Impressions, clicks, CTR

In [182]:
from tabulate import tabulate

### Using SELECT clause MYSQL

In [289]:
cursor.execute('''SELECT * FROM
(SELECT cl.campaign_id, cl.date,  cl.clicks, imp.impressions, cl.clicks/imp.impressions, DENSE_RANK() OVER(PARTITION BY cl.campaign_id ORDER BY cl.date DESC) rank_date
 FROM tbl_clicks as cl INNER JOIN tbl_impressions imp ON cl.campaign_id = imp.campaign_id AND cl.date = imp.date) x
WHERE rank_date<=4;''')
print(tabulate(cursor.fetchall(), headers=['campaign_id', 'date', 'Clicks', 'impressions', 'CTR', 'rank'], tablefmt='psql'))

+---------------+------------+----------+---------------+--------+--------+
|   campaign_id | date       |   Clicks |   impressions |    CTR |   rank |
|---------------+------------+----------+---------------+--------+--------|
|          1001 | 2019-08-09 |       23 |            63 | 0.3651 |      1 |
|          1001 | 2019-08-08 |       59 |            89 | 0.6629 |      2 |
|          1001 | 2019-07-07 |       62 |           112 | 0.5536 |      3 |
|          1001 | 2019-05-06 |       45 |            93 | 0.4839 |      4 |
|          1002 | 2019-05-03 |       88 |           120 | 0.7333 |      1 |
|          1002 | 2019-04-04 |       88 |           108 | 0.8148 |      2 |
|          1002 | 2019-04-02 |       34 |            79 | 0.4304 |      3 |
|          1002 | 2019-03-05 |       55 |           149 | 0.3691 |      4 |
|          1003 | 2019-06-06 |       45 |            98 | 0.4592 |      1 |
|          1003 | 2019-05-05 |       77 |            97 | 0.7938 |      2 |
|          1003 | 2019-03-05 |       45 |           135 | 0.3333 |      3 |
+---------------+------------+----------+---------------+--------+--------+

### Using Pandas

In [208]:
tbl_clicks = pd.read_sql('SELECT * FROM tbl_clicks', engine)

In [209]:
tbl_clicks.head()

   idtbl_clicks  campaign_id  clicks        date
0             1         1001      55  2019-02-09
1             2         1001      45  2019-05-06
2             3         1002      88  2019-05-03
3             4         1002      97  2019-03-02
4             5         1002      25  2019-02-04

In [210]:
tbl_impressions = pd.read_sql('SELECT * FROM tbl_impressions', engine)

In [279]:
tbl_impressions.head()

   idtbl_clicks  campaign_id  impressions        date
0             1         1001           97  2019-02-09
1             2         1001           93  2019-05-06
2             3         1002          120  2019-05-03
3             4         1002          143  2019-03-02
4             5         1002           79  2019-02-04

In [281]:
tbl_merged = pd.merge(tbl_clicks[['campaign_id','date','clicks']], tbl_impressions[['campaign_id','date','impressions']], how='inner', left_on = ['campaign_id', 'date'], right_on= ['campaign_id','date'])

In [283]:
tbl_merged['CTR'] = tbl_merged.clicks / tbl_merged.impressions
tbl_merged.sort_values(['campaign_id','date'], ascending=[True, False], inplace= True)

In [284]:
tbl_merged.head()

    campaign_id        date  clicks  impressions       CTR
13         1001  2019-08-09      23           63  0.365079
9          1001  2019-08-08      59           89  0.662921
10         1001  2019-07-07      62          112  0.553571
1          1001  2019-05-06      45           93  0.483871
0          1001  2019-02-09      55           97  0.567010

In [288]:
# g = tbl_merged.groupby(['campaign_id']).filter(lambda x: len(x)>4)
tbl_merged.groupby(['campaign_id']).head(4)

# sort_values(['date'], ascending = [False])

    campaign_id        date  clicks  impressions       CTR
13         1001  2019-08-09      23           63  0.365079
9          1001  2019-08-08      59           89  0.662921
10         1001  2019-07-07      62          112  0.553571
1          1001  2019-05-06      45           93  0.483871
2          1002  2019-05-03      88          120  0.733333
8          1002  2019-04-04      88          108  0.814815
14         1002  2019-04-02      34           79  0.430380
5          1002  2019-03-05      55          149  0.369128
12         1003  2019-06-06      45           98  0.459184
7          1003  2019-05-05      77           97  0.793814
6          1003  2019-03-05      45          135  0.333333

### Using SELECT clause MYSQL

In [212]:
cursor.execute('''SELECT cl.campaign_id, SUM(cl.clicks) 'Total Clicks', SUM(imp.impressions), SUM(cl.clicks/imp.impressions) as CTR FROM tbl_clicks as cl INNER JOIN tbl_impressions imp ON cl.campaign_id = imp.campaign_id AND cl.date = imp.date
GROUP BY cl.campaign_id;''')
print(tabulate(cursor.fetchall(), headers=['campaign_id', 'Clicks', 'impressions', 'CTR'], tablefmt='psql'))

+---------------+----------+---------------+--------+
|   campaign_id |   Clicks |   impressions |    CTR |
|---------------+----------+---------------+--------|
|          1001 |      244 |           454 | 2.6325 |
|          1002 |      438 |           755 | 4.0047 |
|          1003 |      167 |           330 | 1.5863 |
+---------------+----------+---------------+--------+

### Using Pandas

In [228]:
tbl_merged[['campaign_id','clicks','impressions','CTR']].groupby(['campaign_id']).sum()

             clicks  impressions       CTR
campaign_id
1001            244          454  2.632453
1002            438          755  4.004770
1003            167          330  1.586331

### Using SELECT clause MYSQL

In [214]:
cursor.execute('''SELECT SUM(cl.clicks) 'Total Clicks', SUM(imp.impressions), SUM(cl.clicks/imp.impressions) as CTR FROM tbl_clicks as cl INNER JOIN tbl_impressions imp ON cl.campaign_id = imp.campaign_id AND cl.date = imp.date;''')

print(tabulate(cursor.fetchall(), headers=['Total Clicks', 'Total impressions', 'Total CTR'], tablefmt='psql'))

+----------------+---------------------+-------------+
|   Total Clicks |   Total impressions |   Total CTR |
|----------------+---------------------+-------------|
|            849 |                1539 |      8.2236 |
+----------------+---------------------+-------------+

### Using Pandas

In [236]:
# tbl_merged[['clicks','impressions','CTR']].sum(axis=0).to_frame().transpose()
tbl_merged[['clicks','impressions','CTR']].sum(axis=0).to_frame().T

   clicks  impressions       CTR
0   849.0       1539.0  8.223555